In [67]:
# import library
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

# Importing the source data

In [68]:
suicide_file = 'master.csv'
df=pd.read_csv(suicide_file)

In [69]:
df.head()

,country,year,sex,age,suicides_no,population,suicides/100k pop,country-year,HDI for year,gdp_for_year ($),gdp_per_capita ($),generation
0,Albania,1987,male,15-24 years,21,312900,6.71,Albania1987,NaN,"2,156,624,900",796,Generation X
1,Albania,1987,male,35-54 years,16,308000,5.19,Albania1987,NaN,"2,156,624,900",796,Silent
2,Albania,1987,female,15-24 years,14,289700,4.83,Albania1987,NaN,"2,156,624,900",796,Generation X
3,Albania,1987,male,75+ years,1,21800,4.59,Albania1987,NaN,"2,156,624,900",796,G.I. Generation
4,Albania,1987,male,25-34 years,9,274300,3.28,Albania1987,NaN,"2,156,624,900",796,Boomers

In [70]:
# Drop column country-year
df.drop(columns='country-year', inplace=True)
# Drop column HDI for year
df.drop(columns='HDI for year', inplace=True)
# Drop null values
df.dropna(how='any', inplace=True)
# Drop or filter the rows to only include years 2000 through 2015 (referenced https://stackoverflow.com/questions/13851535/how-to-delete-rows-from-a-pandas-dataframe-based-on-a-conditional-expression)
df.drop(df[(df.year < 2000) | (df.year > 2015)].index, inplace=True)
# check the dataframe structure
df.head()

,country,year,sex,age,suicides_no,population,suicides/100k pop,gdp_for_year ($),gdp_per_capita ($),generation
132,Albania,2000,male,25-34 years,17,232000,7.33,"3,632,043,908",1299,Generation X
133,Albania,2000,male,55-74 years,10,177400,5.64,"3,632,043,908",1299,Silent
134,Albania,2000,female,75+ years,2,37800,5.29,"3,632,043,908",1299,G.I. Generation
135,Albania,2000,male,75+ years,1,24900,4.02,"3,632,043,908",1299,G.I. Generation
136,Albania,2000,female,15-24 years,6,263900,2.27,"3,632,043,908",1299,Generation X

In [71]:
df.shape

(16008, 10)

# write dataframe to a new csv

In [72]:
df.to_csv('suicide_clean.csv', index=False)

In [74]:
df.groupby(['country', 'year']).sum()

                 suicides_no  population  suicides/100k pop  \
country    year
Albania    2000           54     2796300              30.70
           2001          119     2799349              50.62
           2002          133     2818839              62.51
           2003          124     2843929              58.60
           2004          146     2874991              65.39
...                      ...         ...                ...
Uzbekistan 2010         1464    25651783              63.23
           2011         1640    25978049              67.14
           2012         1835    26381830              77.53
           2013         1950    26838924              78.86
           2014         2095    27313507              85.12

                 gdp_per_capita ($)
country    year
Albania    2000               15588
           2001               17412
           2002               18876
           2003               24252
           2004               30528
...                             ...
Uzbekistan 2010               18396
           2011               21204
           2012               23568
           2013               25800
           2014               27708

[1334 rows x 4 columns]

In [75]:
df.to_csv('suicide_aggregated.csv', index=False)